Repository: yeager/swedish-tm
Catalog: reviewed/catalogs/gitlab.tmx
Source language: en
Languages: sv

source: Members|Reverted to LDAP group sync settings.
sv: Members|LDAP-gruppsynkroniseringsinställningarna har återställts.

source: Members|Role updated successfully.
sv: Members|Rollen har uppdaterats.

source: Members|Search invited
sv: Members|Sök efter inbjudna

source: MergeRequests|Create issue to resolve thread
sv: MergeRequests|Skapa ärende för att lösa tråden

source: MergeRequests|Squashing failed: Squash the commits locally, resolve any conflicts, then push the branch.
sv: MergeRequests|Hopslagning misslyckades: slå ihop incheckningarna lokalt, lös konflikterna och skicka sedan upp grenen.

source: MergeRequests|Squashing not allowed: This project doesn't allow you to squash commits when merging.
sv: MergeRequests|Hopslagning är inte tillåten: projektet tillåter inte att du slår ihop incheckningar vid sammanfogning.

source: MergeRequests|Thread stays resolved
sv: MergeRequests|Tråden förblir löst

source: MergeRequests|Thread will be resolved
sv: MergeRequests|Tråden kommer att lösas

source: MergeRequests|View file @ %{commitId}
sv: MergeRequests|Visa fil @ %{commitId}

source: MergeRequests|View replaced file @ %{commitId}
sv: MergeRequests|Visa ersatt fil @ %{commitId}

source: MergeRequests|commented on commit %{commitLink}
sv: MergeRequests|kommenterade incheckningen %{commitLink}

source: MergeRequests|started a thread
sv: MergeRequests|startade en tråd

source: MergeRequests|started a thread on %{linkStart}an old version of the diff%{linkEnd}
sv: MergeRequests|startade en tråd i %{linkStart}en äldre version av diffen%{linkEnd}

source: MergeRequests|started a thread on %{linkStart}the diff%{linkEnd}
sv: MergeRequests|startade en tråd i %{linkStart}diffen%{linkEnd}

source: MergeRequest|Can't show this merge request because of an internal error. Contact your administrator.
sv: MergeRequest|Det går inte att visa den här sammanfogningsbegäran på grund av ett internt fel. Kontakta administratören.

source: MergeRequest|Compare %{target} and %{source}
sv: MergeRequest|Jämför %{target} och %{source}

source: MergeRequest|Error dismissing suggestion popover. Please try again.
sv: MergeRequest|Fel när förslagsdialogrutan skulle stängas. Försök igen.

source: MergeRequest|Error loading full diff. Please try again.
sv: MergeRequest|Fel när hela diffen skulle läsas in. Försök igen.

source: MergeRequest|No files found
sv: MergeRequest|Inga filer hittades

source: Promotions|Webhooks allow you to trigger a URL if, for example, new code is pushed or a new issue is created. You can configure webhooks to listen for specific events like pushes, issues or merge requests. Group webhooks will apply to all projects in a group, allowing you to standardize webhook functionality across your entire group.
sv: Promotions|Webhooks gör att du kan utlösa en URL när till exempel ny kod skickas upp eller ett nytt ärende skapas. Du kan konfigurera webhooks så att de lyssnar efter specifika händelser, till exempel uppskickningar, ärenden eller sammanslagningsförfrågningar. Gruppwebhooks gäller för alla projekt i en grupp, vilket gör att du kan standardisera webhook-funktionaliteten i hela gruppen.

source: CloudSeed|Flexible, scalable NoSQL cloud database for client- and server-side development
sv: CloudSeed|Flexibel, skalbar NoSQL-molndatabas för utveckling på klient- och serversidan

source: DastProfiles|Manage %{profileType} profiles
sv: DastProfiles|Hantera profiler av typen %{profileType}

source: Incident|Something went wrong while fetching incident timeline events.
sv: Incident|Något gick fel när incidentens tidslinjehändelser skulle hämtas.

source: SAML|Your organization's SSO has been connected to your GitLab account
sv: SAML|Organisationens SSO har anslutits till ditt GitLab-konto

source: Incident|Error creating incident timeline event: %{error}
sv: Incident|Fel när incidentens tidslinjehändelse skulle skapas: %{error}

source: Incident|Save and add another event
sv: Incident|Spara och lägg till en annan händelse

source: Incident|Timeline text
sv: Incident|Tidslinjetext

source: Incident|Are you sure you want to delete this event?
sv: Incident|Är du säker på att du vill ta bort den här händelsen?

source: Incident|Delete event
sv: Incident|Ta bort händelse

source: Incident|Error deleting incident timeline event: %{error}
sv: Incident|Fel när incidentens tidslinjehändelse skulle tas bort: %{error}

source: Incident|Something went wrong while creating the incident timeline event.
sv: Incident|Något gick fel när incidentens tidslinjehändelse skulle skapas.

source: Incident|Something went wrong while deleting the incident timeline event.
sv: Incident|Något gick fel när incidentens tidslinjehändelse skulle tas bort.

source: Identity|Provider ID
sv: Identity|Leverantörs-ID

source: MergeRequests|Reference copied
sv: MergeRequests|Referens kopierad

source: DastProfiles|Profile in use and cannot be renamed
sv: DastProfiles|Profilen används och kan inte byta namn

source: Incident|Error updating incident timeline event: %{error}
sv: Incident|Fel när incidentens tidslinjehändelse skulle uppdateras: %{error}

source: Incident|Something went wrong while updating the incident timeline event.
sv: Incident|Något gick fel när incidentens tidslinjehändelse skulle uppdateras.

source: DastProfiles|A site profile defines the attributes and configuration details of your deployed application, website, or API. %{linkStart}Learn more%{linkEnd}.
sv: DastProfiles|En webbplatsprofil definierar attributen och konfigurationsuppgifterna för din driftsatta applikation, webbplats eller API. %{linkStart}Läs mer%{linkEnd}.

source: DastProfiles|Scanner profile
sv: DastProfiles|Skannerprofil

source: DastProfiles|Scanner profiles
sv: DastProfiles|Skannerprofiler

source: DastProfiles|Site profiles
sv: DastProfiles|Webbplatsprofiler

source: CICD|Enable feature to limit job token access to the following projects.
sv: CICD|Aktivera funktionen för att begränsa åtkomsten med jobbtoken till följande projekt.

source: DeployTokens|Expiration date (optional)
sv: DeployTokens|Utgångsdatum (valfritt)

source: DeployTokens|Scopes (select at least one)
sv: DeployTokens|Omfattningar (välj minst en)

source: DastProfiles|Scan Method
sv: DastProfiles|Skanningsmetod

source: SAML|The %{strongOpen}%{group_path}%{strongClose} group allows you to sign in using single sign-on.
sv: SAML|Gruppen %{strongOpen}%{group_path}%{strongClose} tillåter inloggning med enkel inloggning.

source: DeployTokens|Failed to create a new deployment token
sv: DeployTokens|Det gick inte att skapa en ny driftsättningstoken

source: ComplianceStandardsAdherence| Standards adherence export
sv: Export av standardefterlevnad

source: ComplianceStandardsAdherence|Configure branch protection to prevent direct pushes to the default branch.
sv: ComplianceStandardsAdherence|Konfigurera grenskydd för att förhindra direkta uppskick till standardgrenen.

source: ComplianceStandardsAdherence|Configure branch protection to prevent force pushes to repository branches.
sv: ComplianceStandardsAdherence|Konfigurera grenskydd för att förhindra framtvingade uppskick till arkivets grenar.

source: ComplianceStandardsAdherence|Configure branch update requirements
sv: ComplianceStandardsAdherence|Konfigurera krav på grenuppdatering

source: ComplianceStandardsAdherence|Configure code owners to ensure appropriate review of specific code sections.
sv: ComplianceStandardsAdherence|Konfigurera kodägare för att säkerställa lämplig granskning av särskilda kodavsnitt.

source: ComplianceStandardsAdherence|Configure code owners to require approval for code changes.
sv: ComplianceStandardsAdherence|Konfigurera kodägare för att kräva godkännande av kodändringar.

source: ComplianceStandardsAdherence|Configure issue tracking to organize and prioritize project work.
sv: ComplianceStandardsAdherence|Konfigurera ärendespårning för att organisera och prioritera projektarbete.

source: ComplianceStandardsAdherence|Configure job token scope
sv: ComplianceStandardsAdherence|Konfigurera omfång för jobbtoken

source: ComplianceStandardsAdherence|Configure linear history
sv: ComplianceStandardsAdherence|Konfigurera linjär historik

source: ComplianceStandardsAdherence|Configure merge permissions
sv: ComplianceStandardsAdherence|Konfigurera sammanfogningsbehörigheter

source: ComplianceStandardsAdherence|Configure merge requests to require approval from designated code owners.
sv: ComplianceStandardsAdherence|Konfigurera sammanfogningsbegäranden så att de kräver godkännande från angivna kodägare.

source: ComplianceStandardsAdherence|Configure merge requests to reset approvals when new commits are added.
sv: ComplianceStandardsAdherence|Konfigurera sammanfogningsbegäranden så att godkännanden återställs när nya incheckningar läggs till.

source: ComplianceStandardsAdherence|Configure pipeline settings to restrict public access to CI/CD pipelines.
sv: ComplianceStandardsAdherence|Konfigurera pipelineinställningar för att begränsa offentlig åtkomst till CI/CD-pipelines.

source: ComplianceStandardsAdherence|Configure push permissions
sv: ComplianceStandardsAdherence|Konfigurera uppskicksbehörigheter

source: ComplianceStandardsAdherence|Configure push rules to prevent sensitive information from being committed.
sv: ComplianceStandardsAdherence|Konfigurera pushregler för att förhindra att känslig information checkas in.

source: ComplianceStandardsAdherence|Configure push rules to reject unsigned commits.
sv: ComplianceStandardsAdherence|Konfigurera pushregler för att avvisa osignerade incheckningar.

source: ComplianceStandardsAdherence|Configure push rules to require that all commits are signed.
sv: ComplianceStandardsAdherence|Konfigurera pushregler för att kräva att alla incheckningar är signerade.

source: ComplianceStandardsAdherence|Configure settings to ensures that only users with the maintainer role or higher can pass user-defined variables when triggering pipelines.
sv: ComplianceStandardsAdherence|Konfigurera inställningar som säkerställer att endast användare med rollen underhållare eller högre kan skicka användardefinierade variabler när pipelines utlöses.

source: ComplianceStandardsAdherence|Configure settings to prevent editing of merge request approval rules.
sv: ComplianceStandardsAdherence|Konfigurera inställningar för att förhindra redigering av godkännanderegler för sammanfogningsbegäranden.

source: ComplianceStandardsAdherence|Configure status checks
sv: ComplianceStandardsAdherence|Konfigurera statuskontroller

source: ComplianceStandardsAdherence|Configure status page
sv: ComplianceStandardsAdherence|Konfigurera statussida

source: ComplianceStandardsAdherence|Configure strict permissions
sv: ComplianceStandardsAdherence|Konfigurera strikta behörigheter

source: ComplianceStandardsAdherence|Configure your project settings to prevent merge request authors from approving their own changes.
sv: ComplianceStandardsAdherence|Konfigurera projektinställningarna för att förhindra att författare till sammanfogningsbegäranden godkänner sina egna ändringar.

source: ComplianceStandardsAdherence|Enable push protection
sv: ComplianceStandardsAdherence|Aktivera pushskydd

source: ComplianceStandardsAdherence|Enable reset approvals on push
sv: ComplianceStandardsAdherence|Aktivera återställning av godkännanden vid uppskick

source: ComplianceStandardsAdherence|Enable stale branch cleanup
sv: ComplianceStandardsAdherence|Aktivera rensning av inaktuella grenar

source: ComplianceStandardsAdherence|Enforce MFA for contributors
sv: ComplianceStandardsAdherence|Kräv MFA för bidragsgivare

source: ComplianceStandardsAdherence|Enforce code owner approval
sv: ComplianceStandardsAdherence|Kräv godkännande från kodägare

source: ComplianceStandardsAdherence|Ensure each repository has at least two administrators assigned for redundancy.
sv: ComplianceStandardsAdherence|Säkerställ att varje arkiv har minst två administratörer tilldelade för redundans.

source: ComplianceStandardsAdherence|Ensure two administrators per repository
sv: ComplianceStandardsAdherence|Säkerställ två administratörer per arkiv

source: ComplianceStandardsAdherence|Ensure version control is properly configured for your project.
sv: ComplianceStandardsAdherence|Säkerställ att versionshantering är korrekt konfigurerad för projektet.

source: ComplianceStandardsAdherence|Ensure your project has an appropriate number of administrators assigned.
sv: ComplianceStandardsAdherence|Säkerställ att projektet har ett lämpligt antal administratörer tilldelade.

source: ComplianceStandardsAdherence|Ensures CI/CD job token scope restrictions are enabled.
sv: ComplianceStandardsAdherence|Säkerställer att begränsningar för CI/CD-jobbtokenomfång är aktiverade.

source: ComplianceStandardsAdherence|Ensures Infrastructure as Code (IaC) scanning is configured and running in the project's default branch pipeline.
sv: ComplianceStandardsAdherence|Säkerställer att skanning av infrastruktur som kod (IaC) är konfigurerad och körs i standardgrenens pipeline för projektet.

source: ComplianceStandardsAdherence|Ensures Terraform integration is enabled for the project.
sv: ComplianceStandardsAdherence|Säkerställer att Terraform-integrering är aktiverad för projektet.

source: ComplianceStandardsAdherence|Ensures a linear commit history by forbidding merge commits.
sv: ComplianceStandardsAdherence|Säkerställer en linjär incheckningshistorik genom att förbjuda sammanfogningsincheckningar.

source: ComplianceStandardsAdherence|Ensures a status page is configured for the project.
sv: ComplianceStandardsAdherence|Säkerställer att en statussida är konfigurerad för projektet.

source: ComplianceStandardsAdherence|Ensures all discussions must be resolved before merging is allowed.
sv: ComplianceStandardsAdherence|Säkerställer att alla diskussioner måste vara lösta innan sammanfogning tillåts.

source: ComplianceStandardsAdherence|Ensures all package hunter findings are triaged.
sv: ComplianceStandardsAdherence|Säkerställer att alla Package Hunter-fynd är prioriterade.

source: ComplianceStandardsAdherence|Ensures approvals are reset when new commits are pushed to the merge request.
sv: ComplianceStandardsAdherence|Säkerställer att godkännanden återställs när nya incheckningar skickas upp till sammanfogningsbegäran.

source: ComplianceStandardsAdherence|Ensures at least two administrators are assigned to each repository.
sv: ComplianceStandardsAdherence|Säkerställer att minst två administratörer är tilldelade till varje arkiv.

source: ComplianceStandardsAdherence|Ensures automatic cleanup of stale branches is enabled.
sv: ComplianceStandardsAdherence|Säkerställer att automatisk rensning av inaktuella grenar är aktiverad.

source: ComplianceStandardsAdherence|Ensures code changes require approval from code owners.
sv: ComplianceStandardsAdherence|Säkerställer att kodändringar kräver godkännande från kodägare.

source: ComplianceStandardsAdherence|Ensures code quality scanning is configured and running in the project's default branch pipeline.
sv: ComplianceStandardsAdherence|Säkerställer att kodkvalitetsskanning är konfigurerad och körs i standardgrenens pipeline för projektet.

source: ComplianceStandardsAdherence|Ensures container scanning is configured and running in the project's default branch pipeline.
sv: ComplianceStandardsAdherence|Säkerställer att containerskanning är konfigurerad och körs i standardgrenens pipeline för projektet.

source: ComplianceStandardsAdherence|Ensures dependency scanning is configured and running in the project's default branch pipeline.
sv: ComplianceStandardsAdherence|Säkerställer att beroendeskanning är konfigurerad och körs i standardgrenens pipeline för projektet.

source: ComplianceStandardsAdherence|Ensures error tracking is enabled for the project.
sv: ComplianceStandardsAdherence|Säkerställer att felspårning är aktiverad för projektet.

source: ComplianceStandardsAdherence|Ensures fewer administrators are assigned to the project than total members.
sv: ComplianceStandardsAdherence|Säkerställer att färre administratörer är tilldelade till projektet än det totala antalet medlemmar.

source: ComplianceStandardsAdherence|Ensures the project has a valid CI/CD configuration.
sv: ComplianceStandardsAdherence|Säkerställer att projektet har en giltig CI/CD-konfiguration.

source: ComplianceStandardsAdherence|Ensures the source branch is up to date with the target branch before merging.
sv: ComplianceStandardsAdherence|Säkerställer att källgrenen är uppdaterad med målgrenen före sammanfogning.

source: ComplianceStandardsAdherence|Ensures vulnerabilities are addressed within SLO thresholds.
sv: ComplianceStandardsAdherence|Säkerställer att sårbarheter åtgärdas inom SLO-gränser.

source: ComplianceStandardsAdherence|Ensures webhooks are securely configured.
sv: ComplianceStandardsAdherence|Säkerställer att webhooks är säkert konfigurerade.

source: ComplianceStandardsAdherence|Error tracking enabled
sv: ComplianceStandardsAdherence|Felspårning aktiverad

source: ComplianceStandardsAdherence|Establish a process to periodically review and archive inactive repositories.
sv: Inrätta en process för att regelbundet granska och arkivera inaktiva projektarkiv.

source: ComplianceStandardsAdherence|Establish a process to periodically review and remove inactive users.
sv: Inrätta en process för att regelbundet granska och ta bort inaktiva användare.

source: ComplianceStandardsAdherence|Failed controls: %{failed}
sv: Kontroller som misslyckats: %{failed}

source: ComplianceStandardsAdherence|Fix available
sv: Åtgärd finns tillgänglig

source: ComplianceStandardsAdherence|Fix suggestions
sv: Förslag på åtgärder

source: ComplianceStandardsAdherence|Force push disabled
sv: Tvingade pushar är inaktiverade

source: ComplianceStandardsAdherence|Forks exist for the project
sv: Det finns avgreningar av projektet

source: ComplianceStandardsAdherence|Framework
sv: Ramverk

source: ComplianceStandardsAdherence|Frameworks
sv: Ramverk

source: ComplianceStandardsAdherence|GitLab license level Ultimate
sv: GitLab-licensnivån Ultimate

source: ComplianceStandardsAdherence|Go to project settings
sv: Gå till projektinställningarna

source: ComplianceStandardsAdherence|Has valid CI/CD configuration
sv: Har giltig CI/CD-konfiguration

source: ComplianceStandardsAdherence|Have DAST scanner configured in pipeline configuration
sv: Har en DAST-skanner konfigurerad i pipelinekonfigurationen

source: ComplianceStandardsAdherence|Have a valid rule that prevents author-approved merge requests from being merged
sv: Har en giltig regel som hindrar sammanslagning av merge requests som har godkänts av författaren

source: ComplianceStandardsAdherence|Have a valid rule that prevents merge requests with fewer than one non-author approval from being merged
sv: Har en giltig regel som hindrar sammanslagning av merge requests med färre än ett godkännande från någon annan än författaren

source: ComplianceStandardsAdherence|Have a valid rule that prevents merge requests with fewer than two approvals from being merged
sv: Har en giltig regel som hindrar sammanslagning av merge requests med färre än två godkännanden

source: ComplianceStandardsAdherence|Have a valid rule that prevents users from approving merge requests that they've added commits to
sv: Har en giltig regel som hindrar användare från att godkänna merge requests som de har lagt till incheckningar i

source: ComplianceStandardsAdherence|How to fix
sv: Så här åtgärdar du det

source: ComplianceStandardsAdherence|IaC scanning running
sv: IaC-skanning körs

source: ComplianceStandardsAdherence|Implement repository review process
sv: Inför en granskningsprocess för projektarkiv

source: ComplianceStandardsAdherence|Passed controls: %{passed}
sv: Godkända kontroller: %{passed}

source: ComplianceStandardsAdherence|Pending
sv: Väntande

source: ComplianceStandardsAdherence|Pending controls: %{pending}
sv: Väntande kontroller: %{pending}

source: ComplianceStandardsAdherence|Prevent author approvals
sv: Förhindra godkännanden från författaren

source: ComplianceStandardsAdherence|Prevent authors as approvers
sv: Förhindra författare som godkännare

source: ComplianceStandardsAdherence|Prevent committer approvals
sv: Förhindra godkännanden från incheckare

source: ComplianceStandardsAdherence|Prevent committers as approvers
sv: Förhindra incheckare som godkännare

source: ComplianceStandardsAdherence|Prevents deletion of branches.
sv: Förhindrar borttagning av grenar.

source: ComplianceStandardsAdherence|Prevents direct pushes to the default branch.
sv: Förhindrar direkta pushar till standardgrenen.

source: ComplianceStandardsAdherence|Prevents editing of merge request approval rules.
sv: Förhindrar redigering av godkännanderegler för merge requests.

source: ComplianceStandardsAdherence|Prevents force pushing to repositories.
sv: Förhindrar tvingade pushar till projektarkiv.

source: ComplianceStandardsAdherence|Prevents users who have committed to a merge request from approving it.
sv: Förhindrar användare som har gjort incheckningar i en merge request från att godkänna den.

source: ComplianceStandardsAdherence|Project not archived
sv: Projektet är inte arkiverat

source: ComplianceStandardsAdherence|Project not marked for deletion
sv: Projektet är inte markerat för borttagning

source: ComplianceStandardsAdherence|Project pipelines not public
sv: Projektets pipelines är inte offentliga

source: ComplianceStandardsAdherence|Project repository exists
sv: Projektarkivet finns

source: ComplianceStandardsAdherence|Project visibility not public
sv: Projektets synlighet är inte offentlig

source: ComplianceStandardsAdherence|Protected branches exist
sv: Skyddade grenar finns

source: ComplianceStandardsAdherence|Push protection enabled
sv: Pushskydd är aktiverat

source: ComplianceStandardsAdherence|Raw filter values is not currently supported. Please use available values.
sv: Råa filtervärden stöds inte för närvarande. Använd tillgängliga värden.

source: ComplianceStandardsAdherence|Restrict variable creation
sv: Begränsa skapandet av variabler

source: ComplianceStandardsAdherence|Restricted build access
sv: Begränsad byggåtkomst

source: ComplianceStandardsAdherence|Restricts access to build artifacts and pipeline outputs.
sv: Begränsar åtkomsten till byggartefakter och pipelineutdata.

source: ComplianceStandardsAdherence|Restricts who can push to or merge into protected branches.
sv: Begränsar vilka som kan pusha till eller slå samman i skyddade grenar.

source: ComplianceStandardsAdherence|Review and archive stale repositories
sv: Granska och arkivera inaktuella projektarkiv

source: ComplianceStandardsAdherence|Review and remove inactive users
sv: Granska och ta bort inaktiva användare

source: ComplianceStandardsAdherence|Review and secure all webhook configurations to prevent unauthorized access.
sv: Granska och säkra alla webhookkonfigurationer för att förhindra obehörig åtkomst.

source: ComplianceStandardsAdherence|Review and triage all package hunter findings to assess and address potential risks.
sv: Granska och bedöm alla träffar från Package Hunter för att utvärdera och hantera potentiella risker.

source: ComplianceStandardsAdherence|Review and update the project status to ensure it is not marked for deletion.
sv: Granska och uppdatera projektets status för att säkerställa att det inte är markerat för borttagning.

source: ComplianceStandardsAdherence|Review archive status
sv: Granska arkiveringsstatus

source: ComplianceStandardsAdherence|Review project status
sv: Granska projektstatus

source: ComplianceStandardsAdherence|Review the project archive status and unarchive if necessary for active projects.
sv: Granska projektets arkiveringsstatus och avarkivera vid behov aktiva projekt.
